/*******************************************************************************
* タイトル:		フィールドプログラム
* プログラム名:	field.cpp
* 作成者:		GP11A132 25 松本　賢治
* 作成日:		2022/07/07
*******************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "field.h"
#include "player.h"
#include "enemy.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言(こんな関数を用意してありますよ宣言/関数の説明書)
*******************************************************************************/



/*******************************************************************************
* グローバル変数
*******************************************************************************/

// マップデータ
char field_org[FIELD_H][FIELD_W + 1] = { // オリジナルfieldデータ（横を+1しているのは文末のNULLの分）
	"****************************************",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                ****            T     *",
	"*                *  *                  *",
	"*                ****                  *",
	"*    S                                 *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"****************************************",
};

char field[FIELD_H][FIELD_W + 1] = {	// 表示用fieldデータ（横を+1しているのは文末のNULLの分）
	"****************************************",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                ****            T     *",
	"*                *  *                  *",
	"*                ****                  *",
	"*    S                                 *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"*                                      *",
	"****************************************",
};



// fieldの初期化処理
void InitField(void)
{
	/* オリジナルfieldデータを表示用fieldデータへコピー */
	memcpy(field, field_org, sizeof(field));

}


// fieldの終了処理
void UninitField(void)
{

}


// fieldの更新処理
void UpdateField(void)
{
	/* オリジナルfieldデータを表示用fieldデータへコピー */
	memcpy(field, field_org, sizeof(field));

}


// field描画処理
void DrawField(void)
{
	/* 処理速度調整 */
	Sleep(30);

	/* 画面クリア */
	system("cls");

	/* マップ描画処理 */
	for (int i = 0; i < FIELD_H; i++)
	{
		printf("%s\n", &field[i][0]);	// 上から１行ずつ描画
	}

	PLAYER* player = GetPlayer();

	ENEMY* enemy = GetEnemy();

	printf("シーフ　ＬＶ 1\n");
	printf("ＨＰ %d\n", player->hp);
	printf("ＭＰ %d\n", player->mp);
	printf("ＧＯＬＤ %d\n", player->gold);
	printf("装備\n");
	



	if (player->hae==1)
	{
	printf("古代魔学の大剣\n");
	}
	

	if (player->boe == 1)
	{
		printf("竜鱗鎧\n");
		
	}


}


// 指定した座標にdataを書き込む
void SetField(int y, int x, char data)
{
	field[y][x] = data;
}


// 指定した座標に書かれているfieldデータを取得する
char GetField(int y, int x)
{
	return field[y][x];
}


// 指定した座標はOKな場所？
// OKな場所なら0
// NGな場所なら0以外
int CheckField(int y, int x)
{

	PLAYER* player = GetPlayer();


	int ans = 0;	// とりあえずOKをセットしておく

	// NGな場所？
	char data = field[y][x];
	switch(data)
	{
	case '*':
		ans = 1;	// その場所はNGだったので1をセットする
		break;
	
	case 'T':
		ans = 2;

		break;

	case 'S':
		ans = 3;

		break;


	default:
		break;
	}

	return ans;		// 結果を返す
	
}
