/*******************************************************************************
* タイトル:		プレイヤーヘッダー
* プログラム名:	player.h
* 作成者:		GP11A132 25 松本　賢治
* 作成日:		2022/07/07
*******************************************************************************/

#pragma once	// インクルードガード（多重インクルード防止）

/*******************************************************************************
* インクルードファイル
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct PLAYER
{



	// フィールド用メンバー変数
	int x;				// X座標
	int y;				// Y座標

	int old_x;			// 一歩前のX座標
	int old_y;			// 一歩前のY座標


	// バトル用メンバー変数
	int hp, hp_max;		// HP / HP Max
	int mp, mp_max;		// MP / MP Max
	int atk, atk_max;	// 攻撃力
	int def, def_max;
	int enc;
	int gold;
	int stps;

	int hae;//hand equipment
	int boe;//body equipment
	bool trb;	//トレジャーボックスフラグ
	bool flg1;	//フラグ
	bool flg2;	//フラグ

};


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

// プレイヤーのアドレスを返す
PLAYER *GetPlayer(void);


