/*******************************************************************************
* タイトル:		リザルトプログラム
* プログラム名:	result.cpp
* 作成者:		GP11A132 25 松本　賢治
* 作成日:		2022/07/07
*******************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "result.h"
#include "battle1.h"
#include "battle2.h"
#include "player.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言(関数の説明書)
*******************************************************************************/



/*******************************************************************************
* グローバル変数
*******************************************************************************/









int g_ResultLoopCount;			// タイトルの描画を繰り返す為のカウンター

// 縦24行分、横80文字分を4画面分
char result[DISP_H * ANIM_CNT][DISP_W] = {
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",



	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                            企画   松本 賢治                                  \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                          プログラム   松本 賢治                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",


	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                            THANKYOU FOR PLAYING!!                            \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",
	"                                                                              \n",




};



// タイトルの初期化処理
void InitResult(void)
{
	g_ResultLoopCount = 0;

}


// タイトルの終了処理
void UninitResult(void)
{
	//SetMode(GAME_RESULT);
}


// タイトルの更新処理
void UpdateResult(void)
{
	//// テストでルパン３世を２回繰り返してみる
	//g_ResultLoopCount++;
	//if (g_ResultLoopCount > 1)
	//{
	//	// キー入力待ち
	//	rewind(stdin);
	//	_getch();

	////	SetMode(GAME_TITLE);		// ２回やったら終了させる。本当はここで次のゲームモードへ移行する
	//}

}


// タイトル画面処理
void DrawResult(void)
{


	PLAYER* player = GetPlayer();

	printf("RESULT %dg\n", player->gold);


	// キー入力待ち
	rewind(stdin);
	_getch();


	// 画面クリア
	system("cls");




	/* 画面描画処理 */
	for (int y = 0; y < DISP_H * ANIM_CNT; y++)
	{
		/* 1画面分表示したら少しウェイトさせる */
		if (y % DISP_H == 0)
		{
			/* ウェイト */
			Sleep(500);

			/* 画面クリア */
			//system("cls");
		}

		///* 1文字ずつ描画する */
		//for (int x = 0; x < DISP_W; x++)
		//{
		//	// ここに1文字ずつ表示するプログラムを書く
		//	printf("%c", result[y][x]);
		//}

		// １文字ずつだと遅いから１行ずつ表示させる
		printf("%s", &result[y][0]);

		Sleep(100);

	}


	Sleep(500);

	SetMode(GAME_TITLE);

	player->hp= player->hp_max;
	player->mp = player->mp_max;
	player->gold=0;
	player->stps = 0;

	player->atk =50;
	player->atk_max =50;
	player->def =5;
	player->def_max =5;
	player->hae = 0;
	player->boe = 0;





	// キー入力待ち
	rewind(stdin);
	_getch();
	// 画面クリア
	system("cls");

}



