/*******************************************************************************
* タイトル:		ショッププログラム
* プログラム名:	shop.cpp
* 作成者:		GP11A132 25 松本　賢治
* 作成日:		2022/07/07
*******************************************************************************/


/*******************************************************************************
* scanf のwarning防止
*******************************************************************************/
#define _CRT_SECURE_NO_WARNINGS


/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdio.h>
#include <conio.h>
#include <Windows.h>
#include <time.h>



#include "main.h"
#include "shop.h"
#include "player.h"
#include "enemy.h"
#include "field.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言(こんな関数を用意してありますよ宣言/関数の説明書)
*******************************************************************************/


/*******************************************************************************
* グローバル変数
*******************************************************************************/

void InitShop(void)
{
}

void UninitShop(void)
{
}

void UpdateShop(void)
{
	PLAYER* player = GetPlayer();
	int i = 0;
	int hensuu = 0;

	// 画面クリア
	system("cls");

	printf("[店主]\n");
	printf("「いらっしぇい！」\n");


	while (i == 0)
	{
		printf("1 やめる　2 回復[500g]\n");
		// キー入力待ち
		rewind(stdin);
		_getch();

		scanf("%d", &hensuu);

		// 画面クリア
		system("cls");

		switch (hensuu)
		{
		case 1:
			i = 1;
			break;

		case 2:
			if (player->gold < 500)
			{
				printf("[店主]\n");
				printf("「金が足りやせんぜぇい」\n");
			}
			if (player->gold >= 500)
			{
				player->gold = player->gold - 500;
				player->hp = player->hp_max;
				player->mp = player->mp_max;

				printf("ＨＰが全快になった！\n");
				printf("ＨＰ残り%d\n\n", player->mp);
				printf("ＭＰが全快になった！\n");
				printf("ＭＰ残り%d\n\n", player->mp);
				printf("[シーフ]\n");
				printf("「元気いっぱいだ！」\n");


				// キー入力待ち
				rewind(stdin);
				_getch();


				// 画面クリア
				system("cls");

				break;
			}
		}
	}
	printf("[店主]\n");
	printf("「ありがとうございました！」\n");


	// キー入力待ち
	rewind(stdin);
	_getch();


	// 画面クリア
	system("cls");

	/* 処理速度調整 */
	Sleep(30);

	player->flg2=true;
	SetMode(GAME_MODE);

}

	/*******************************************************************************/




void DrawShop(void)
{
	
}